# BaseArray Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseArray Class
Members See Also
---
An abstract base class that represents an array within the Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class BaseArray : Element
```

Visual Basic
---
```text
Public MustInherit Class BaseArray _
	Inherits Element
```

Visual C++
---
```text
public ref class BaseArray abstract : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..BaseArray Autodesk.Revit.DB..::..LinearArray Autodesk.Revit.DB..::..RadialArray
# See Also
BaseArray Members
Autodesk.Revit.DB Namespace